In [1]:
import pandas as pd

In [2]:
people = {
    'First':['Keshav','Rahul','Rajesh'],
    'Last' :['Sharma','Sharma','Kushwaha'],
    'Email':['Kesh4118@gmail.com','Rahul81.rs@gmail.com','Kush@gmail.com']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    First      Last                 Email
0  Keshav    Sharma    Kesh4118@gmail.com
1   Rahul    Sharma  Rahul81.rs@gmail.com
2  Rajesh  Kushwaha        Kush@gmail.com

In [7]:
df.columns = ["First_name","Last_name","Email"]

In [8]:
df

  First_name Last_name                 Email
0     Keshav    Sharma    Kesh4118@gmail.com
1      Rahul    Sharma  Rahul81.rs@gmail.com
2     Rajesh  Kushwaha        Kush@gmail.com

In [14]:
df.columns = [x.upper() for x in df.columns]

In [15]:
df

  FIRST_NAME LAST_NAME                 EMAIL
0     Keshav    Sharma    Kesh4118@gmail.com
1      Rahul    Sharma  Rahul81.rs@gmail.com
2     Rajesh  Kushwaha        Kush@gmail.com

In [16]:
df.columns = [x.lower() for x in df.columns]

In [17]:
df

  first_name last_name                 email
0     Keshav    Sharma    Kesh4118@gmail.com
1      Rahul    Sharma  Rahul81.rs@gmail.com
2     Rajesh  Kushwaha        Kush@gmail.com

In [27]:
# df.columns = df.columns.str.replace("_"," ")
df.columns = df.columns.str.replace(" ","_")

In [28]:
df

  first_name last_name                 email
0     Keshav    Sharma    Kesh4118@gmail.com
1      Rahul    Sharma  Rahul81.rs@gmail.com
2     Rajesh  Kushwaha        Kush@gmail.com

In [29]:
#  df.email = [Email]
# we can't change any columns like this,if we try we got error.

In [45]:
df.rename(columns={'first_name':'First','email':'Email'},inplace=True)

# inplace use for parmanent changes

In [46]:
df

    First last_name                 Email
0  Keshav    Sharma    Kesh4118@gmail.com
1   Rahul    Sharma  Rahul81.rs@gmail.com
2  Rajesh  Kushwaha        Kush@gmail.com

In [47]:
df.columns = ["First_name","Last_name","Email"]
df.columns = [x.lower() for x in df.columns]
df
#back to previews stat

  first_name last_name                 email
0     Keshav    Sharma    Kesh4118@gmail.com
1      Rahul    Sharma  Rahul81.rs@gmail.com
2     Rajesh  Kushwaha        Kush@gmail.com